# def 함수에 대해서 배웠다.
# def 함수이름 (파라미터1, 파라미터2, ....) + return .
# 함수를 지정해두면 좋은 점 1. 책임전가가 가능해진다 => 오류난 부분이 어디인지 확실히 알 수 있다. 2. 코드가 보기 깔끔해진다. (짧아짐) 3. 변수만 바꿔주면 되기에 굉장히 편리하다.
#
# SET 집합에 대해 배웠다. 집합은 중복되지 않는 요소의 모임이며 {}를 쓴다. 
# 집합은 return type을 갖지 않는다.
#
# for문과 if문에 대해서 다시 배웠다.
# 왜 if의 가동범위 안으로 else if 가 들어가면 안되는가? 
# else if의 정의는 <if a:> 가 아닐 때(else) if B: 면 가동범위 안의 것을 실행해라. 만약 if 안의 블럭으로 들어가버리면 <if a:>라는 조건이 없어지기 때문에 사용이 불가능하다.  
#
# 왜 for문 안에서 정의된 sum과 밖에서 정의된 sum은 다른가?
# => 안에서 정의된 sum은 매번 for문이 돌 때마다 처음 지정했던 값으로 돌아온다. 반면 밖의 sum은 for문이 바뀔 때마다 바뀐 sum값을 계속 저장하고 있다.
# 마찬가지로 print()또한 밖에 있고 안에 있는 것에 차이가 있다. for문 안에 있으면 range로 정의한 만큼 반복된다.

# 앞으로 java의 상속구조 spring을 배울 것이다. array 배열 배운 후에
# 